# Brewfile for @solangii

# tap "homebrew/cask"
# tap "homebrew/cask-fonts"
tap "mas-cli/tap" 
brew "mas" 

brew "tmux"
brew "lsd"
brew "bat"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "git-delta"
brew "jq"
brew "trash"
brew "git"
brew "git-lfs"
brew "gh"
brew "neovim"
brew "pyenv"
brew "node"
brew "cmake"
brew "gcc"
brew "zsh"
brew "tree"
brew "wget"
brew "htop"
brew "eza"
brew "zoxide"
brew "neofetch"
brew "git-quick-stats"

cask "pycharm"
cask "datagrip"
cask "intellij-idea"
cask "docker"
cask "wezterm"
cask "iterm2"
cask "google-chrome"
cask "hiddenbar"
cask "maccy"
cask "visual-studio-code"
cask "postman"
cask "obsidian"
cask "typora"
cask "naver-whale"
cask "sublime-text"
cask "cursor"
cask "google-drive"
cask "iina"
cask "slack"
cask "discord"
cask "filezilla"
cask "synology-drive"
cask "keka"

cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"

mas "Magnet", id: 441258766
mas "TickTick", id: 1260799325
mas "KakaoTalk", id: 869223134
